Repository: burunduk/heroeswog-l10n-test
Catalog: tm/script02_EN_RU.tmx
Source language: en
Languages: ru

source: he
ru: он

source: she
ru: она

source: his
ru: его

source: her
ru: ее

source: %Z326's Surcoat Of Counterpoise grows warm, then cold, then warm again.
ru: Мантия Равновесия, которой обладает %Z326, становится теплой, затем холодной, затем снова теплой...

source: It's unclear what it's doing, but it seems to be doing something.
ru: Неясно, что происходит, но похоже, дело в Мантии.

source: Impressed by %Z326's interest in Birds, some Royal Griffins join %Z328 army.
ru: Впечатленные тем, что %Z326 интересуется птицами, несколько Королевских Грифонов желают вступить в %Z328 армию.

source: Joyful at %Z326's interest in Life and its Pendants, some Sprites join %Z328 army.
ru: Довольные, что %Z326 интересуется жизнью и ее символами, несколько Фей желают вступить в %Z328 армию.

source: Mindful of %Z326's devotion to Death and its Pendants, some Zombies join %Z328 army.
ru: Заметив, что %Z326 хранит преданность смерти и ее символам, несколько Зомби желают вступить в %Z328 армию.

source: Pleased with %Z326's ability to cast spells on magic resistant creatures, an Archmage joins %Z328 army.
ru: Изумленный тем, что %Z326 имеет способность творить заклинания на защищенных от магии существ, Архи-Маг желает присоединиться к %Z328 армии.

source: Pleased with %Z326's ability to cast spells on magic resistant creatures, some Archmages join %Z328 army.
ru: Изумленные тем, что %Z326 имеет способность творить заклинания на защищенных от магии существ, несколько Архи-Магов желают вступить в %Z328 армию.

source: Pleased with %Z326's ability to cast spells on magic resistant creatures, and impressed by %Z328 devotion to Wisdom, some Archmages join %Z328 army.
ru: Изумленные тем, что %Z326 имеет способность творить заклинания на защищенных от магии существ, и тем, что хранит преданность Мудрости, несколько Архи-Магов желают вступить в %Z328 армию.

source: Heartened by %Z326's protection from Dispel, a Mighty Gorgon joins %Z328 army.
ru: Ободренная тем, что %Z326 защищает от Рассеивания, Могучая Горгона желает присоединиться к %Z328 армии.

source: Heartened by %Z326's protection from Dispel, some Mighty Gorgons join %Z328 army.
ru: Ободренные тем, что %Z326 защищает от Рассеивания, несколько Могучих Горгон желают вступить в %Z328 армию.

source: Heartened by %Z326's protection from Dispel, and impressed by %Z328 devotion to Defense, some Mighty Gorgons join %Z328 army.
ru: Ободренные тем, что %Z326 защищает от Рассеивания, и тем, что он хранит преданность Защите, несколько Могучих Горгон желают вступить в %Z328 армию.

source: Eventually, everyone dies... %Z326 has been tramping around so long in the Dead's Man's Boots, %Z327 can't tell them apart from %Z328 other shoes...
ru: В конечном счете, все умирают... %Z326 топчет всю округу в Сапогах Мертвеца и в итоге не может отделить их от ещё одной пары...

source: With %Z328 handy Pendant, %Z326 is remembering all sorts of useful things... some %Z327 never knew in the first place!
ru: С %Z328 удобным брелком, %Z326 помнит множество полезных вещей... И даже узнает что-то новое!

source: With %Z328 Emblem Of Cognizance, %Z326 would surely notice if any of %Z328 troops kept any loot for themselves.
ru: С %Z328 Символом Знаний, %Z326 несомненно заметит, если кто-то из %Z328 солдат спрячет заначку.

source: That's what they think at least.
ru: Что они себе думают, в конце концов?!.

source: They cough up %Vj gold per troop per Emblem (but no more then %Y5 gold per Emblem).
ru: Они вынуждены платить %Vj за каждого и за каждый Символ Знаний.

source: Through the magic of the Stoic Watchman, a large area around %Z326 is revealed.
ru: Своей магией Бесстрашный Хранитель открывает большое пространство вокруг места, где стоит %Z326.

source: By studying with %Z326's Pendant Of Second Sight, %Z328 low-level shooting troops (if any) improve themselves.
ru: Обучаясь с помощью Брелка Ясновидения, которым владеет %Z326, %Z328 неулучшенные стрелки низших уровней улучшаются.

source: By communing with the Pendant of Holiness, %Z326 would have learned a holy spell... but %Z327 has no spell book.
ru: По соглашению со Священным Брелком герой %Z326 мог бы выучить святое заклинание.... но %Z327 не имеет Книги Заклинаний.

source: By communing with the Pendant Of Holiness, %Z326 learns a holy spell.
ru: По соглашению со Священным Брелком %Z326 учит святое заклинание.

source: %Z326's troops are eager to cover ground. %Z326 could probably go a lot further today, but it would wear out %Z328 Boots Of Polarity.
ru: Солдаты героя по имени %Z326 готовы преодолевать большие расстояния, и он мог бы далеко продвинуться сегодня, но нужно снять %Z328 Сапоги Противодействия.

source: Is that worth it to you?
ru: вы согласны сделать это?

source: %Z326's troops grumble, but resign themselves to a long slow journey.
ru: %Z326 видит, что солдаты ворчат, но уступают и соглашаются на долгое и медленное путешествие.

source: %Z326 gets ready for a long journey.
ru: %Z326 собирается в дальний путь.

source: An irritated wizard appears before %Z326 and says: "There's been some Interference mucking up my experiments, and... I think it's coming from your Garniture.
ru: Раздраженный колдун появляется перед Героем по имени %Z326 и произносит: "Что-то мешает, портит мне эксперимент, и... я думаю, это идет от твоего ожерелья.

source: I'll teach you %Z329 if you give me the thing.
ru: Я сделаю так, что %Z329 будет в числе твоих навыков, если ты отдашь мне эту штуковину.

source: Deal?"
ru: Согласен?"

source: The wizard frowns, then disappears without saying a word.
ru: Колдун нахмурился и исчез не сказав ни слова.

source: The wizard says, "Sadly, you are already an expert in %Z329.
ru: Колдун сказал, "Жаль, вы уже эксперт в том, что называется %Z329.

source: I couldn't cheat you out of your cursed Garniture." He vanishes.
ru: Я не могу обманывать даже ради проклятого ожерелья." Он исчез.

source: The wizard smiles politely.
ru: Колдун вежливо улыбнулся.

source: "Thanks.
ru: "Спасибо.

source: Now I can get on with my work." He vanishes.
ru: теперь я могу приступить к своей работе." Он исчез.

source: With Dispassion comes calm... with calm comes Knowledge.
ru: Вода приносит успокоение... спокойствие приносит понимание.

source: %Z326 learns.
ru: %Z326 учится.

source: The Pendant Of Free Will works its mischievous magic on %Z326's mindless Golems and weak-willed Peasants (if any)!
ru: Брелок Свободы использует свою озорную магию на бездумных големов и слабовольных крестьян в армии Героя по имени %Z326!

source: Some of %Z326's troops think that %Z327 should make a donation to a local charity.
ru: В армии Героя по имени %Z326 некоторые солдаты думают, что %Z327 поступит правильно, если сделает пожертвование местной церкви.

source: A Diplomat's Ring would do nicely.
ru: Кольцо Дипломата идеально подошло бы для этой цели.

source: Does %Z326 make this generous donation?
ru: Дает ли %Z326 согласие сделать это щедрое пожертвование?

source: %Z326's troops are impressed by %Z328 generosity... %Z328 ranks swell with new recruits!
ru: %Z326 поражает своих солдат щедростью... И %Z328 ряды пополнились новыми рекрутами!

source: %Z326's troops grumble, but resign themselves to serving a stingy hero.
ru: %Z326 вызывает недовольство солдат, но они уступают, мирясь с глухотой Героя.

source: attack twice
ru: атаковать дважды

source: not be retaliated against
ru: не получать ответного удара

source: Peering deep inside %Z328 Orb Of Inhibition, %Z326 can see a djinn trapped within.
ru: В ровной глубине %Z328 Сферы Запрещения, %Z326 видит плененного Джина.

source: The djinn pleads to be freed.
ru: Джин просит об освобождении.

source: "I see you are a lover of %Z330," it says.
ru: "Я вижу %Z330 вам нравятся," говорит он.

source: "If you set me free, I will make it so that, from this day forth, all %Z330 will %Z331 in battle!"
ru: "Если вы освободите меня, я сделаю так, что с этого дня, все %Z330 будут способны %Z331 в бою!"

source: Does %Z326 shatter the Orb, to free the djinn?
ru: Хочет ли %Z326 разрушить сферу,чтобы освободить Джина?

source: The grateful djinn fulfills his promise!
ru: Благодарный Джин выполняет свое обещание!

source: The djinn retreats sadly back into the mists inside the Orb.
ru: Джин с грустью удаляется обратно вглубь тумана внутри сферы.

source: The Rampaging Ogre wants his Targ back!
ru: Буйный Огр хочет получить свою дубину назад!

source: His minions attack %Z326!!
ru: Его слуги атакуют!!!

source: You could give your Statesman's Medal to this town.
ru: Вы можете отдать вашу Медаль Дипломата этому городу.

source: The citizens might be pleased enough to build something in your honor.
ru: Горожане могут отблагодарить вас постройкой чего-нибудь в вашу честь.

source: Do you give the town your Medal?
ru: Вы отдадите городу медаль?

source: They probably wouldn't have built anything for you anyway.
ru: Возможно горожане не будут больше ничего строить для вас ни при каких обстоятельствах.

source: The citizens of your town are ecstatic!
ru: Жители вашего города в восторге!

source: They build the %Z326, %Z327, and %Z328 in your honor!
ru: Ими построено: %Z326, %Z327, и %Z328 в вашу честь!

source: The citizens of your town are overjoyed!
ru: Жители вашего города обрадованы!

source: They build the %Z326 and %Z327 in your honor!
ru: Ими построено: %Z326 и %Z327 в вашу честь!

source: They build the %Z326 and %Z328 in your honor!
ru: Ими построено: %Z326 и %Z328 в вашу честь!

source: They build the %Z327 and %Z328 in your honor!
ru: Ими построено: %Z327 и %Z328 в вашу честь!

source: The citizens of your town are pleased.
ru: Жители вашего города польщены.

source: They build the %Z326 in your honor.
ru: Ими построено: %Z326 в вашу честь.

source: They build the %Z327 in your honor.
ru: Ими построено: %Z327 в вашу честь.

source: They build the %Z328 in your honor.
ru: Ими построено: %Z328 в вашу честь.

source: The citizens of your town are sadly unimpressed.
ru: Жители вашего города разочарованы.

source: After a short look onto the Medal, they give it back with a shrug of the shoulders.
ru: Они приняли Медаль, но ничего не построили.

source: %Z-1 Weekly creature status: %Z-2 Do you wish to change the status to %Z-3?
ru: %Z-1 Статус прихода существ раз в неделю: %Z-2 Вы хотите изменить статус на %Z-3?

source: %Z-1 already has knowledge of all spells available with %Z-2 {Pendant} {of} {Holiness}.
ru: %Z-1 уже знает все заклинания, оберегаемые %Z-2 {Медалью} {Святости}.

source: Maybe another Hero needs some lessons...
ru: Возможно, другой герой нуждается в нескольких уроках...

source: By communing with the Pendant of Holiness, %Z-1 would have learned Destroy Undead... but %Z-1 has no Wisdom!
ru: По договору с {Медалью} {Святости}, %Z-1 мог бы выучить Уничтожение Живых Мертвецов... но %Z-1 не имеет мудрости!

source: By communing with the Pendant of Holiness, %Z-1 would have learned Resurrection... but %Z-1 has not the required Wisdom level!
ru: По договору с Медалью Святости, %Z-1 мог бы выучить Воскрешение... но %Z-1 имеет недостаточный уровень мудрости!

source: By communing with the Pendant of Holiness, %Z-1 would have learned Prayer... but %Z-1 has not the required Wisdom level!
ru: По договору с Медалью Святости, %Z-1 мог бы выучить Молитву... но %Z-1 имеет недостаточный уровень мудрости!
